TILE_SIZE = 32      # перезапишемо під розмір екрану в Game
FPS = 60

GAME_TITLE = "Dungeon of Lost Memories"

LEVEL_MAP = [
    "########################",
    "#.....M....W......H....#",
    "#..##......####......E.#",
    "#..##..A.....R..M......#",
    "#..........####........#",
    "#......................#",
    "#..........####........#",
    "#..M.............A.....#",
    "#........H.............#",
    "#..............##..M...#",
    "#P.....................#",
    "########################",
]



# Текст вступу (історія гри)
INTRO_LINES = [
    "Ти прокидаєшся у холодному підземеллі.",
    "Пам'ять розбита на уламки — ти не пам'ятаєш, хто ти.",
    "На стінах — дивні символи, а вдалині чути кістлявий скрегіт.",
    "Хтось, або щось, не хоче, щоб ти вибрався звідси...",
    "",
    "Натисни будь-яку клавішу, щоб почати."
]
